## [ 텍스트 데이터 처리 ]
- 다양한 형태의 텍스트 데이터를 정리하기 위한 방법들
- Series에 str 속성을 활용해 str 제공 전용 메서드 사용 가능
- 사용방법 : SR.str.method()

In [2]:
# Accessors : 지시자
# - 특정 데이터 타입 전용 메서드에 진입
# - 종류 : dt, str, cat, sparse  (각 날짜, 문자열, 카테고리, sparse)
# - 예  : SR.str.strip()

In [7]:
# [ .str.strip( ) ]
msg = "   Merry Christmas        "
len(msg)

26

In [8]:
msg1, msg2, msg3 = msg.strip(), msg.lstrip(), msg.rstrip()

In [9]:
len(msg1), len(msg2), len(msg3)
# 양쪽 제거 / 왼쪽 제거 / 오른쪽 제거

(15, 23, 18)

<hr>

In [11]:
# 1. 모듈 로딩
import pandas as pd
# 2. 데이터 준비
file = '../DATA/chicago_food_inspections.csv'
# 3. 데이터 저장
chicagoDF = pd.read_csv(file)

# 4. 데이터 확인
chicagoDF.info(), chicagoDF.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 153810 entries, 0 to 153809
Data columns (total 2 columns):
 #   Column  Non-Null Count   Dtype
---  ------  --------------   -----
 0   Name    153810 non-null  object
 1   Risk    153744 non-null  object
dtypes: object(2)
memory usage: 2.3+ MB

(None,
                           Name             Risk
 0   MARRIOT MARQUIS CHICAGO       Risk 1 (High)
 1                  JETS PIZZA   Risk 2 (Medium)
 2                   ROOM 1520      Risk 3 (Low)
 3    MARRIOT MARQUIS CHICAGO      Risk 1 (High)
 4                CHARTWELLS       Risk 1 (High))

In [17]:
# [문제] Name 컬럼에서 공백제거 처리
# chicagoDF.Name.strip()  => Series는 strip을 할 수 없다
chicagoDF.Name = chicagoDF.Name.str.strip()   # .str 필요
chicagoDF

                                Name             Risk
0            MARRIOT MARQUIS CHICAGO    Risk 1 (High)
1                         JETS PIZZA  Risk 2 (Medium)
2                          ROOM 1520     Risk 3 (Low)
3            MARRIOT MARQUIS CHICAGO    Risk 1 (High)
4                         CHARTWELLS    Risk 1 (High)
...                              ...              ...
153805                     WOLCOTT'S    Risk 1 (High)
153806  DUNKIN DONUTS/BASKIN-ROBBINS  Risk 2 (Medium)
153807                      Cafe 608    Risk 1 (High)
153808                   mr.daniel's    Risk 1 (High)
153809                    TEMPO CAFE    Risk 1 (High)

[153810 rows x 2 columns]

In [20]:
# [문제] Rist 컬럼에서 문자열 나누기 => Risk 숫자 => Risk와 숫자 분리

# 결측값 확인
chicagoDF['Risk'].nunique(), chicagoDF['Risk'].unique()

(4,
 array(['Risk 1 (High)', 'Risk 2 (Medium)', 'Risk 3 (Low)', 'All', nan],
       dtype=object))

In [21]:
chicagoDF['Risk'].isna().sum(), chicagoDF.isna().sum()

(66,
 Name     0
 Risk    66
 dtype: int64)

In [24]:
# [ .dropna() ] : 기본값이 행, 행 내 하나라도 있으면 삭제
chicagoDF.dropna().shape

(153744, 2)

In [25]:
# [( subset= [col] )] : col('Risk') 컬럼이 NaN인 행 삭제
chicagoDF.dropna(subset=['Risk']).shape

(153744, 2)

In [27]:
# replace( ) : 'All' -> 'Risk 4 (Extreme)'
chicagoDF["Risk"].replace('all','Risk 4 (Extreme)')

0           Risk 1 (High)
1         Risk 2 (Medium)
2            Risk 3 (Low)
3           Risk 1 (High)
4           Risk 1 (High)
               ...
153805      Risk 1 (High)
153806    Risk 2 (Medium)
153807      Risk 1 (High)
153808      Risk 1 (High)
153809      Risk 1 (High)
Name: Risk, Length: 153810, dtype: object

In [28]:
# [ .slice(start, stop, step) ] : slice를 하는 함수
# Risk의 숫자만 도출

chicagoDF['Risk'].str.slice(5,6)

0         1
1         2
2         3
3         1
4         1
         ..
153805    1
153806    2
153807    1
153808    1
153809    1
Name: Risk, Length: 153810, dtype: object

In [29]:
# Series에 upper하기: .str.upper()
chicagoDF['Risk'].str.slice(8,-1).str.upper()

0           HIGH
1         MEDIUM
2            LOW
3           HIGH
4           HIGH
           ...
153805      HIGH
153806    MEDIUM
153807      HIGH
153808      HIGH
153809      HIGH
Name: Risk, Length: 153810, dtype: object

In [31]:
# 참고) to_list, to_frame도 있다 (파라미터 쓰기에 좋을 듯)